tap "benbjohnson/litestream"
tap "hashicorp/tap"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/services"
tap "jsdelivr/globalping"
tap "lihaoyun6/tap"
tap "nxtrace/nexttrace"
tap "ynqa/tap"
# Simple, modern, secure file encryption
brew "age"
# Mozilla CA certificate store
brew "ca-certificates"
# Download with resuming and segmented downloading
brew "aria2"
# General-purpose data compression with high compression ratio
brew "xz"
# Interpreted, interactive, object-oriented programming language
brew "python@3.12"
# Record and share terminal sessions
brew "asciinema"
# Code searching, linting, rewriting
brew "ast-grep"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# New way of working with Protocol Buffers
brew "buf"
# Mozilla CA bundle for Python
brew "certifi"
# Manage your dotfiles across multiple diverse machines, securely
brew "chezmoi"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# Diff that understands syntax
brew "difftastic"
# Tool for exploring each layer in a docker image
brew "dive"
# Simple, fast and user-friendly alternative to find
brew "fd"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# Syntax-highlighting pager for git and diff output
brew "git-delta"
# Git extension for versioning large files
brew "git-lfs"
# Open-source GitLab command-line tool
brew "glab"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Command-line interface for Hetzner Cloud
brew "hcloud"
# Improved top (interactive process viewer)
brew "htop"
# Command-line benchmarking tool
brew "hyperfine"
# Feature-packed proxy & relay tool optimized for lossy, unstable connections
brew "hysteria"
# Update of iperf: measures TCP, UDP, and SCTP bandwidth
brew "iperf3"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Handy way to save and run project-specific commands
brew "just"
# Save disk space by cleaning non-essential files from software projects
brew "kondo"
# C library for reading, creating, and modifying zip archives
brew "libzip"
# Mac App Store command-line interface
brew "mas"
# Replacement for ls, cp and other commands for object storage
brew "minio-mc"
# Fast, highly customisable system info script
brew "neofetch"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Port scanning utility for large networks
brew "nmap"
# Platform built on V8 to build network applications
brew "node@20"
# Pinentry for GPG on Mac
brew "pinentry-mac"
# Execute binaries from Python packages in isolated environments
brew "pipx"
# Fast, disk space efficient package manager
brew "pnpm"
# Object-relational database system
brew "postgresql@15"
# Modern replacement for ps written by Rust
brew "procs"
# Protocol buffers (Google's data interchange format)
brew "protobuf"
# Rsync for cloud storage
brew "rclone"
# Persistent key-value database, with built-in net interface
brew "redis"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Generate type safe Go from SQL
brew "sqlc"
# CLI for extracting streams from various websites to a video player
brew "streamlink"
# Log file highlighter
brew "tailspin"
# User interface to the TELNET protocol
brew "telnet"
# Simplified and community-driven man pages
brew "tldr"
# Program that allows you to count code, quickly
brew "tokei"
# CLI tool that moves files or folder to the trash
brew "trash"
# Network diagnostic tool, inspired by mtr
brew "trippy"
# Generate WireGuard profile from Cloudflare Warp account
brew "wgcf"
# Lookup tool for domain names and other internet resources
brew "whois"
# Friendly and fast tool for sending HTTP requests
brew "xh"
# Feature-rich command-line audio/video downloader
brew "yt-dlp"
brew "jsdelivr/globalping/globalping"
# An open source visual route tracking CLI tool
brew "nxtrace/nexttrace/nexttrace"
# JSON navigator and interactive filter leveraging jq
brew "ynqa/tap/jnv"
# Android SDK component
cask "android-platform-tools"
# Voice and text chat software
cask "discord"
# Collaborative team software
cask "figma"
# Developer targeted fonts with a high number of glyphs
cask "font-fira-code-nerd-font"
# Developer targeted fonts with a high number of glyphs
cask "font-fira-mono-nerd-font"
# Developer targeted fonts with a high number of glyphs
cask "font-hack-nerd-font"
# Developer targeted fonts with a high number of glyphs
cask "font-inconsolata-nerd-font"
# Developer targeted fonts with a high number of glyphs
cask "font-jetbrains-mono-nerd-font"
# Developer targeted fonts with a high number of glyphs
cask "font-sauce-code-pro-nerd-font"
# Audio player
cask "foobar2000"
# Free and open-source media player
cask "iina"
# Open-source screen recorder built with web technology
cask "kap"
# Open-source keystroke visualiser
cask "keycastr"
# Utility that shows the latest app updates
cask "latest"
# App to write, plan, collaborate, and get organised
cask "notion"
# Quick Look plugin for plaintext files without an extension
cask "qlstephen"
# Quick Look plugin for JSON files
cask "quicklook-json"
# A lightweight and high-performance screen recorder for macOS.
cask "quickrecorder"
# Open source virtual/remote desktop application
cask "rustdesk"
# Snip or pin screenshots
cask "snipaste"
# Real time file synchronisation software
cask "syncthing"
# JDK from the Eclipse Foundation (Adoptium)
cask "temurin21"
# Cloud video conferencing
cask "tencent-meeting"
# Quick Look plugin for webp files
cask "webpquicklook"
mas "APTV", id: 1630403500
mas "Bob", id: 1630034110
mas "Cubox", id: 1113361350
mas "LocalSend", id: 1661733229
mas "Microsoft Remote Desktop", id: 1295203466
mas "PasteNow", id: 1552536109
mas "Stay", id: 1591620171
mas "Tailscale", id: 1475387142
mas "TestFlight", id: 899247664
mas "TickTick", id: 966085870
mas "WeChat", id: 836500024
mas "WPS Office", id: 1468073139
vscode "astro-build.astro-vscode"
vscode "bradlc.vscode-tailwindcss"
vscode "chakrounanas.turbo-console-log"
vscode "christian-kohler.path-intellisense"
vscode "codeium.codeium"
vscode "dbaeumer.vscode-eslint"
vscode "dsznajder.es7-react-js-snippets"
vscode "eamodio.gitlens"
vscode "esbenp.prettier-vscode"
vscode "formulahendry.code-runner"
vscode "github.vscode-github-actions"
vscode "golang.go"
vscode "humao.rest-client"
vscode "lokalise.i18n-ally"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "pkief.material-icon-theme"
vscode "ritwickdey.liveserver"
vscode "usernamehw.errorlens"
vscode "vue.volar"
